kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
static void process_cmd_check(valid_data_t *data, const panel_cfg_t *temp_cfg, panel_status_t *temp_status)
{
    switch (data->data[1]) {

        case ALL_CLOSE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if ((BIT5(temp_cfg[i].key_perm) == true) && // 屏蔽掉没有勾选"睡眠"的按键
                    ((H_BIT(data->data[4]) == H_BIT(temp_cfg[i].key_area)) || (H_BIT(data->data[4]) == 0xF))) {
                    switch (temp_cfg[i].key_func) {
                        case ALL_CLOSE:
                            panel_fast_exe(&temp_status[i], (0b00011010 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        case NIGHT_LIGHT:
                        case DND_MODE:
                            panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | 0x01);
                            break;
                        case SCENE_MODE:
                        case LIGHT_MODE:
                        case ALL_ON_OFF:
                        case CLEAN_ROOM:
                            panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | 0x00);
                            break;
                        default:
                            break;
                    }
                }
            }
        } break;
        case ALL_ON_OFF: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if ((BIT5(temp_cfg[i].key_perm) == true) && // 屏蔽掉没有勾选"总开关"的按键
                    ((H_BIT(data->data[4]) == H_BIT(temp_cfg[i].key_area)) || (H_BIT(data->data[4]) == 0xF))) {
                    switch (temp_cfg[i].key_func) {
                        case ALL_ON_OFF:
                            panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        case NIGHT_LIGHT:
                        case DND_MODE:
                            panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (~data->data[2] & 0x01));
                            break;
                        case SCENE_MODE:
                        case LIGHT_MODE:
                        case CLEAN_ROOM:
                            panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        case ALL_CLOSE:
                            panel_fast_exe(&temp_status[i], (0b00011010 & ~0x01) | (data->data[2] & 0x01));
                            break;
                        default:
                            break;
                    }
                }
            }
        } break;
        case CLEAN_ROOM: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == CLEAN_ROOM &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xFF)) {
                    if (data->data[2] == true) {
                        for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                            if (temp_cfg[j].key_func == DND_MODE &&
                                (data->data[3] == temp_cfg[j].key_group || data->data[3] == 0xFF)) {
                                panel_fast_exe(&temp_status[j], (0b00010110 & ~0x01) | (~data->data[2] & 0x01));
                            }
                        }
                    }
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case DND_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == DND_MODE &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xFF)) {
                    if (data->data[2] == true) {
                        for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) {
                            if (temp_cfg[j].key_func == CLEAN_ROOM &&
                                (data->data[3] == temp_cfg[j].key_group || data->data[3] == 0xFF)) {
                                panel_fast_exe(&temp_status[j], (0b00010110 & ~0x01) | (~data->data[2] & 0x01));
                            }
                        }
                    }
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case LATER_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == LATER_MODE &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xFF)) {
                    panel_fast_exe(&temp_status[i], (0b00100110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case CHECK_OUT: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == CHECK_OUT &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xFF)) {
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case SOS_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == SOS_MODE &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xFF)) {
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case SERVICE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == SERVICE &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xFF)) {
                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                }
            }
        } break;
        case CURTAIN_OPEN: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == CURTAIN_OPEN &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xFF)) {
                    for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) { // 先关闭同分组的"窗帘关"
                        if (temp_cfg[j].key_func == CURTAIN_CLOSE &&
                            (data->data[3] == temp_cfg[j].key_group || data->data[3] == 0xFF)) {
                            panel_fast_exe(&temp_status[j], (0b00110000 & ~0x01) | 0x00);
                        }
                    }
                    panel_fast_exe(&temp_status[i], (0b00101010 & ~0x01) | 0x01);
                }
            }
        } break;
        case CURTAIN_CLOSE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == CURTAIN_CLOSE &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xFF)) {
                    for (uint8_t j = 0; j < KEY_NUMBER_COUNT; j++) { // 先关闭同分组的"窗帘开"
                        if (temp_cfg[j].key_func == CURTAIN_OPEN &&
                            (data->data[3] == temp_cfg[j].key_group || data->data[3] == 0xFF)) {
                            panel_fast_exe(&temp_status[j], (0b00110000 & ~0x01) | 0x00);
                        }
                    }
                    panel_fast_exe(&temp_status[i], (0b00101010 & ~0x01) | 0x01);
                }
            }
        } break;
        case SCENE_MODE: { // 场景模式
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if ((temp_cfg[i].key_scene_group != 0x00) && // 屏蔽掉没有勾选任何场景分组的按键
                    ((L_BIT(data->data[4]) == L_BIT(temp_cfg[i].key_area)) || (L_BIT(data->data[4]) == 0xF))) {

                    panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | 0x00); // 先关闭该场景区域的所有分组
                    uint8_t mask = data->data[7] & temp_cfg[i].key_scene_group;   // 找出两个字节中同为1的位
                    if (mask != 0) {                                              // 任意一位同为1,说明勾选了该场景分组,执行动作
                        panel_fast_exe(&temp_status[i], (0b00010110 & ~0x01) | (data->data[2] & 0x01));
                    }
                }
            }
        } break;
        case LIGHT_MODE: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {

