kepler-444b/GD_gd32e230c8t6/Source/device/panel_key.c
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }
        } break;
        case NIGHT_LIGHT: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_cfg[i].key_func == data->data[1] &&
                    temp_cfg[i].key_group == data->data[3] &&
                    temp_cfg[i].key_group != 0x00) {
                    temp_status[i].led_w_open = data->data[2];
                    temp_status[i].relay_open = data->data[2];
                    temp_status[i].key_status = data->data[2];
                }
            }
        } break;
        case LIGHT_UP:
            break;
        case LIGHT_DOWN:
            break;
        case DIMMING_3:
            break;
        case DIMMING_4:
            break;
        case UNLOCKING:
            break;
        case BLUETOOTH:
            break;
        case CURTAIN_STOP: {
            for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
                if (temp_status[i].relay_short == true &&
                    (data->data[3] == temp_cfg[i].key_group || data->data[3] == 0xFF)) {
                    panel_fast_exe(&temp_status[i], (0b00111010 & ~0x01) | 0x00);
                }
            }
        } break;
        case VOLUME_ADD:
            break;
        case VOLUME_SUB:
            break;
        case PLAY_PAUSE:
            break;
        case NEXT_SONG:
            break;
        case LAST_SONG:
            break;
        default:
            return;
    }
}

static void panel_ctrl_led_all(bool led_state, bool is_ex)
{
    panel_status_t *temp = NULL;
#ifndef PANEL_8KEY
    temp = my_panel_status;
#endif
#if defined PANEL_8KEY
    temp = is_ex ? my_panel_status_ex : my_panel_status;
#endif
    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        temp[i].led_w_open = led_state;
    }
}

static void panel_event_handler(event_type_e event, void *params)
{
    switch (event) {
        case EVENT_ENTER_CONFIG: {
            panel_ctrl_led_all(true, false);
            my_common_panel.enter_config = true;
        } break;
        case EVENT_EXIT_CONFIG: {
            panel_ctrl_led_all(false, false);
            my_common_panel.enter_config = false;
            NVIC_SystemReset(); // 退出"配置模式"后触发软件复位
        } break;
        case EVENT_SAVE_SUCCESS: {
            my_common_panel.led_filck = true;
        } break;
#if defined PANEL_8KEY
        case EVENT_ENTER_CONFIG_EX:
            panel_ctrl_led_all(true, true);
            my_common_panel_ex.enter_config = true;
            break;
        case EVENT_EXIT_CONFIG_EX: {
            panel_ctrl_led_all(false, true);
            my_common_panel_ex.enter_config = false;
            NVIC_SystemReset();
        } break;
        case EVENT_SAVE_SUCCESS_EX: {
            my_common_panel_ex.led_filck = true;
        } break;
#endif
        case EVENT_RECEIVE_CMD: {
            valid_data_t *valid_data = (valid_data_t *)params;
            panel_data_cb(valid_data);
        } break;
        default:
            return;
    }
}

// 执行上电参数(迎宾)
static void panel_power_status(void)
{
    const panel_cfg_t *temp_cfg = app_get_panel_cfg();

    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        if (temp_cfg[i].key_perm & 0x08) { // 权限是否勾选"迎宾"
            my_panel_status[i].led_w_open = true;
            my_panel_status[i].relay_open = true;
            my_panel_status[i].key_status = true;
        }
    }
#if defined PANEL_8KEY
    const panel_cfg_t *temp_cfg_ex = app_get_panel_cfg_ex();
    for (uint8_t i = 0; i < KEY_NUMBER_COUNT; i++) {
        if (temp_cfg_ex[i].key_perm & 0x08) { // 权限是否勾选"迎宾"
            my_panel_status_ex[i].led_w_open = true;
            my_panel_status_ex[i].relay_open = true;
            my_panel_status_ex[i].key_status = true;
        }
    }
#endif
}

static void panel_fast_exe(panel_status_t *temp_fast, uint8_t flag)
{
    // 0位:data->data[2];1位:key_status;2位:led_w_open,3位:led_w_short,4位:relay_open;5位:relay_short;6位:保留;7位:保留

    if (BIT1(flag) == true) {
        temp_fast->key_status = BIT0(flag);
    }
    if (BIT2(flag) == true) {
        temp_fast->led_w_open = BIT0(flag);
    }
    if (BIT3(flag) == true) {
        temp_fast->led_w_short = true; // 短亮会快速熄灭,无需持续状态,故而不受data->data[2]控制
    }
    if (BIT4(flag) == true) {
        temp_fast->relay_open = BIT0(flag);
    }
    if (BIT5(flag) == true) {
        temp_fast->relay_short = BIT0(flag);
    }
}
#endif